In [1]:
import pandas as pd
import numpy as np
import os
from pydataset import data

# 4. Iris
In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
# 4a print the first three rows

data('iris').head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [3]:
# 4b print the number of rows and columns

data('iris').shape

(150, 5)

In [4]:
# 4c print the column names

data('iris').columns.to_list()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [5]:
#  4d print the data types of each column

data('iris').dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [24]:
# print the summary statistics for each of the numeric variables. 
#     Would you recommend rescaling the data based on these statistics?

stats = data('iris').describe().T
stats

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

##### Would you recommend rescaling data based on summary stats?
>The data points are all in the same units so do not see a need to scale at this time. 

>If there were a larger range of values there may be a case to scale the data, even though they are all measured in the same units since many ML algorithms use a distance measurement to weight feature importance

In [25]:
stats['range'] = stats['max'] - stats['min']
stats

              count      mean       std  min  25%   50%  75%  max  range
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9    3.6
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4    2.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9    5.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5    2.4

# 5. Customer Details 
Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [7]:
# 5a. 1st 100 rows

df_excel = pd.read_excel('Excel_Exercises.xlsx', sheet_name = 'Table1_CustDetails')
df_excel_sample = df_excel.head(100)

In [8]:
# 5b. no of rows in original df

df_excel.shape[0]

7049

In [42]:
# 5c. column names

df_excel.columns.to_list()

['customer_id',
 'gender',
 'is_senior_citizen',
 'partner',
 'dependents',
 'phone_service',
 'internet_service',
 'contract_type',
 'payment_type',
 'monthly_charges',
 'total_charges',
 'churn',
 'Unnamed: 12',
 'Unnamed: 13']

In [10]:
# column names with object datatype

df_excel.columns[[df_excel[col].dtype == 'object' for col in df_excel.columns]]

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [43]:
# another way to get the object datatype only columns ----> select_dtypes(include = 'object')

# gives us DataFrame
df_excel.select_dtypes(include = 'object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [12]:
# .columns : from DataFrame -----> Index

df_excel.select_dtypes(include = 'object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [13]:
# .tolist() from Index ----> list

df_excel.select_dtypes(include = 'object').columns.to_list()

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [14]:
# 5e. range for each of numeric values

# df_excel.columns[[df_excel[col].dtype == 'int']]

stats = df_excel.describe().T
stats['max'] - stats['min']

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
Unnamed: 12             NaN
Unnamed: 13             NaN
dtype: float64

# 6. Google Sheet

In [29]:
# acquiring data from Google sheet

url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
url = url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(url)

In [34]:
# 6a assign first 100 rows to new DataFrame

first_hun = df_google.head(100)
first_hun.shape[0]

100

In [16]:
# 6b .shape: number of rows and columns

print(f'There are {df_google.shape[0]} rows and {df_google.shape[1]} columns.')

There are 891 rows and 12 columns.

In [51]:
# 6c column names with dtype = 'object'

print(f'Object Column Names: \n\n {df_google.select_dtypes(include = "object").columns.to_list()}')

Object Column Names:

 ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [52]:
# data type of each column with object data type

print(df_google.select_dtypes(include = 'object').columns)

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [54]:
# 6d. datatypes of each column

df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [38]:
# 6e. descriptive stats for numerical columns

google_stats = df_google.describe().T
google_stats

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [66]:
df_google.select_dtypes(include = 'object')

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [72]:
# 6f. unique values for each of the categorical variables

for col in df_google.columns:
    if df_google[col].dtypes == 'object':
        print(f'{col} has {df_google[col].nunique()} unique values')

Name has 891 unique values
Sex has 2 unique values
Ticket has 681 unique values
Cabin has 147 unique values
Embarked has 3 unique values

In [75]:
df_google.Sex.value_counts(dropna = False)

male      577
female    314
Name: Sex, dtype: int64

In [76]:
df_google.Embarked.value_counts(dropna = False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64